{
   "severity":"medium",
   "rule":"$.resource[*].google_container_cluster[*].*[*].node_config anyNull or $.resource[*].google_container_cluster[*].*[*].node_config[*].service_account anyNull",
   "id":"f125951d-f5c0-4ca6-aab2-d443485e04a1",
   "enabled":true,
   "resourceType":"k8s container cluster service account",
   "policy":"GCP Kubernetes Engine Cluster Nodes have default Service account for Project access",
   "description": "This policy identifies Kubernetes Engine Cluster Nodes which have default Service account for Project access. By default, Kubernetes Engine nodes are given the Compute Engine default service account. This account has broad access and more permissions than are required to run your Kubernetes Engine cluster. You should create and use a least privileged service account to run your Kubernetes Engine cluster instead of using the Compute Engine default service account. If you are not creating a separate service account for your nodes, you should limit the scopes of the node service account to reduce the possibility of a privilege escalation in an attack.",
   "recommendation": {
      "name": "Recommended solution to ensuring that Kubernetes Engine Cluster Nodes does not have default Service account for Project access.",
      "description": "Ensure that GCP Kubernetes Engine Cluster Nodes does not have default Service account for Project access. Please make sure that the template have \"node_config\" defined and \"service_account\" is present under it and is not null.",
      "snippet": "\"node_config\": [\n                {\n                  \"labels\": [\n                    {\n                      \"foo\": \"bar\"\n                    }\n                  ],\n                  \"metadata\": [\n                    {\n                      \"disable-legacy-endpoints\": \"true\"\n                    }\n                  ],\n                  \"oauth_scopes\": [\n                    \"https://www.googleapis.com/auth/logging.write\",\n                    \"https://www.googleapis.com/auth/monitoring\"\n                  ],\n                  \"tags\": [\n                    \"foo\",\n                    \"bar\"\n                  ],\n                  \"service_account\" : \"service_account\"\n                }]"
   }
}
